``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.training-vm-eu[2] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-2.eu.training.galaxyproject.eu_A"
        name    = "gat-2.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.42.4",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.training-vm-eu[2] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-2.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "dcc9001ddbd39600b7002f2d9e4999f4bba3a7f1"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ training_ips-eu = [
      - [
          - "192.52.42.1",
          - "192.52.46.84",
          - "192.52.42.4",
          - "192.52.46.180",
          - "192.52.45.246",
          - "192.52.46.221",
          - "192.52.45.171",
          - "192.52.45.202",
          - "192.52.42.8",
          - "192.52.42.251",
        ],
      + [
          + "192.52.42.1",
          + "192.52.46.84",
          + (known after apply),
          + "192.52.46.180",
          + "192.52.45.246",
          + "192.52.46.221",
          + "192.52.45.171",
          + "192.52.45.202",
          + "192.52.42.8",
          + "192.52.42.251",
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```